spec/vcr_cassettes/asendia/shipments/un_authenticated.yml

---
http_interactions:
- request:
    method: post
    uri: https://asendia.sandbox.mpm.metapack.net/Blackbox/BlackBox.svc
    body:
      encoding: UTF-8
      string: "<s:Envelope xmlns:s=\"http://schemas.xmlsoap.org/soap/envelope/\">\n
        <s:Header>\n\t<wsse:Security xmlns:wsse=\"http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd\">\n\t\t<wsse:UsernameToken>\n\t\t\t<wsse:Username>HACKER-N00bie</wsse:Username>\n\t\t\t<wsse:Password
        Type=\"http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText\">GET-REKT</wsse:Password>\n\t\t</wsse:UsernameToken>\n\t</wsse:Security>\n\t<h:Authentication
        xmlns:i=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:h=\"http://xlogics.eu/blackbox\">\n\t\t<h:Culture>EN</h:Culture>\n\t\t<h:UnitName>H4CK3r</h:UnitName>\n\t</h:Authentication>\n
        </s:Header>\n  <s:Body>\n    <PrintParcelRequest xmlns=\"http://xlogics.eu/blackbox\">\n
        \     <InputParameters xmlns:i=\"http://www.w3.org/2001/XMLSchema-instance\">\n
        \     \n       \t<ShippingParameter>\n          <Name>Shipment.RefNo</Name>\n
        \         <Value>DONT@ME</Value>\n        </ShippingParameter>\n      \n       \t<ShippingParameter>\n
        \         <Name>AA.Service</Name>\n          <Value>PTLP</Value>\n        </ShippingParameter>\n
        \     \n       \t<ShippingParameter>\n          <Name>Shipment.ReturnValue</Name>\n
        \         <Value>ShipmentIdentcode;AA.UniqueReference</Value>\n        </ShippingParameter>\n
        \     \n       \t<ShippingParameter>\n          <Name>AA.Reference2</Name>\n
        \         <Value>MEMEZ</Value>\n        </ShippingParameter>\n      \n       \t<ShippingParameter>\n
        \         <Name>AA.EmailAlert</Name>\n          <Value>TRUE</Value>\n        </ShippingParameter>\n
        \     \n       \t<ShippingParameter>\n          <Name>AA.DocumentsOnly</Name>\n
        \         <Value>FALSE</Value>\n        </ShippingParameter>\n      \n       \t<ShippingParameter>\n
        \         <Name>AA.ExportType</Name>\n          <Value>Merchandise</Value>\n
        \       </ShippingParameter>\n      \n       \t<ShippingParameter>\n          <Name>AA.InvoiceNo</Name>\n
        \         <Value>2+2-1=3</Value>\n        </ShippingParameter>\n      \n       \t<ShippingParameter>\n
        \         <Name>AA.VatNo</Name>\n          <Value>1222</Value>\n        </ShippingParameter>\n
        \     \n       \t<ShippingParameter>\n          <Name>Receiver.RefNo</Name>\n
        \         <Value>CUSTOMER-REFERENCE</Value>\n        </ShippingParameter>\n
        \     \n       \t<ShippingParameter>\n          <Name>Receiver.CompanyName</Name>\n
        \         <Value>MANS NOT HOT LIMTED</Value>\n        </ShippingParameter>\n
        \     \n       \t<ShippingParameter>\n          <Name>Receiver.Name1</Name>\n
        \         <Value>BIG</Value>\n        </ShippingParameter>\n      \n       \t<ShippingParameter>\n
        \         <Name>Receiver.Name2</Name>\n          <Value>SHAQ</Value>\n        </ShippingParameter>\n
        \     \n       \t<ShippingParameter>\n          <Name>Receiver.HouseNo</Name>\n
        \         <Value>21</Value>\n        </ShippingParameter>\n      \n       \t<ShippingParameter>\n
        \         <Name>Receiver.Street</Name>\n          <Value>121 LYNX EFFECT</Value>\n
        \       </ShippingParameter>\n      \n       \t<ShippingParameter>\n          <Name>Receiver.AddressDetails</Name>\n
        \         <Value>Quick Maths</Value>\n        </ShippingParameter>\n      \n
        \      \t<ShippingParameter>\n          <Name>Receiver.City</Name>\n          <Value>LYNX-2+2-1</Value>\n
        \       </ShippingParameter>\n      \n       \t<ShippingParameter>\n          <Name>Receiver.Province</Name>\n
        \         <Value>MY Province</Value>\n        </ShippingParameter>\n      \n
        \      \t<ShippingParameter>\n          <Name>Receiver.Postcode</Name>\n          <Value>CF123343</Value>\n
        \       </ShippingParameter>\n      \n       \t<ShippingParameter>\n          <Name>Receiver.Country</Name>\n
        \         <Value>FR</Value>\n        </ShippingParameter>\n      \n       \t<ShippingParameter>\n
        \         <Name>Receiver.Telephone</Name>\n          <Value>123445555</Value>\n
        \       </ShippingParameter>\n      \n       \t<ShippingParameter>\n          <Name>Receiver.Mobile</Name>\n
        \         <Value>1233444433</Value>\n        </ShippingParameter>\n      \n
        \      \t<ShippingParameter>\n          <Name>Receiver.Email</Name>\n          <Value>big.shaq@man-not-hot.com</Value>\n
        \       </ShippingParameter>\n      \n       \t<ShippingParameter>\n          <Name>Receiver.Email</Name>\n
        \         <Value>big.shaq@man-not-hot.com</Value>\n        </ShippingParameter>\n
        \     \n       \t<ShippingParameter>\n          <Name>Parcel.Weight</Name>\n
        \         <Value>11</Value>\n        </ShippingParameter>\n      \n       \t<ShippingParameter>\n
        \         <Name>Parcel.Width</Name>\n          <Value>22</Value>\n        </ShippingParameter>\n
        \     \n       \t<ShippingParameter>\n          <Name>Parcel.Height</Name>\n
        \         <Value>10</Value>\n        </ShippingParameter>\n      \n       \t<ShippingParameter>\n
        \         <Name>Parcel.Length</Name>\n          <Value>14</Value>\n        </ShippingParameter>\n
         \     \n        <ShippingParameter>\n          <Name>ProductParcel</Name>\n
        \         <Value>\n            <![CDATA[<Table>\n            \n            <Row>\n
        \           \n            <ASLineItemNo>\n              1\n            </ASLineItemNo>\n
        \           \n            <ASProductDesc>\n              BIG BOX\n            </ASProductDesc>\n
        \           \n            <ASUnitQuantity>\n              2\n            </ASUnitQuantity>\n
        \           \n            <ASUnitValue>\n              12\n            </ASUnitValue>\n
        \           \n            <ASCurrency>\n              GBP\n            </ASCurrency>\n
        \           \n            <ASUnitWeight>\n              1\n            </ASUnitWeight>\n
        \           \n            <ASCountry>\n              GBR\n            </ASCountry>\n
        \           \n            <ASHSTariff>\n              RTE\n            </ASHSTariff>\n
        \           \n            </Row>\n            \n            <Row>\n            \n
        \           <ASLineItemNo>\n              2\n            </ASLineItemNo>\n
        \           \n            <ASProductDesc>\n              ANOTHER BIG BOX\n
        \           </ASProductDesc>\n            \n            <ASUnitQuantity>\n
        \             1\n            </ASUnitQuantity>\n            \n            <ASUnitValue>\n
        \             10\n            </ASUnitValue>\n            \n            <ASCurrency>\n
        \             GBP\n            </ASCurrency>\n            \n            <ASUnitWeight>\n
        \             1\n            </ASUnitWeight>\n            \n            <ASCountry>\n
        \             GBR\n            </ASCountry>\n            \n            <ASHSTariff>\n
        \             ETE\n            </ASHSTariff>\n            \n            </Row>\n
        \           \n          </Table>]]>\n          </Value>\n        </ShippingParameter>\n
        \     </InputParameters>\n    </PrintParcelRequest>\n  </s:Body>\n</s:Envelope>\n"
    headers:
      Content-Type:
      - text/xml
      Soapaction:
      - http://xlogics.eu/blackbox/BlackBoxContract/PrintParcel
  response:
    status:
      code: 500
      message: Internal Server Error
    headers:
      Date:
      - Wed, 21 Mar 2018 13:06:16 GMT
      Content-Type:
      - text/xml; charset=utf-8
      Content-Length:
      - '274'
      Connection:
      - keep-alive
      Set-Cookie:
      - __cfduid=dc97b404fd38d9c08fd89b157e8ccae8d1521637576; expires=Thu, 21-Mar-19
        13:06:16 GMT; path=/; domain=.metapack.net; HttpOnly
      X-Content-Security-Policy:
      - default-src 'self' 'unsafe-inline' 'unsafe-eval';
      Content-Security-Policy:
      - default-src 'self' 'unsafe-inline' 'unsafe-eval';
      X-Xss-Protection:
      - 1; mode=block
      Access-Control-Allow-Origin:
      - "*"
      X-Content-Type-Options:
      - nosniff
      X-Dns-Prefetch-Control:
      - 'off'
      X-Frame-Options:
      - DENY
      X-Webkit-Csp:
      - default-src 'self' 'unsafe-inline' 'unsafe-eval';
      Expect-Ct:
      - max-age=604800, report-uri="https://report-uri.cloudflare.com/cdn-cgi/beacon/expect-ct"
      Server:
      - cloudflare
      Cf-Ray:
      - 3ff0a2846ca006ee-LHR
    body:
      encoding: UTF-8
      string: '<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Body><s:Fault><faultcode>s:AuthenticationError</faultcode><faultstring
        xml:lang="en-US">Authorization error: A user with the specified credentials
        doesn''t exist!</faultstring></s:Fault></s:Body></s:Envelope>'
    http_version: 
  recorded_at: Wed, 21 Mar 2018 13:06:16 GMT
recorded_with: VCR 4.0.0
